Latihan indexing, selecting, assigning

Pengenalan

Memilih nilai spesifik dari pandas DataFrame atau Series untuk dikerjakan adalah langkah implisit di hampir semua operasi data yang akan Anda jalankan, jadi salah satu hal pertama yang perlu Anda pelajari dalam bekerja dengan data dengan Python adalah cara memilih data poin yang relevan bagi Anda dengan cepat dan efektif.

In [1]:
# mengimport module yang dibutuhkan
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# mempersiapkan data yang diperlukan
Data = pd.read_csv('C:\Latihan\Latihan\Python\Sample Data\olympics2024.csv')
Data

    Rank        Country Country Code  Gold  Silver  Bronze  Total
0      1  United States           US    40      44      42    126
1      2          China          CHN    40      27      24     91
2      3          Japan          JPN    20      12      13     45
3      4      Australia          AUS    18      19      16     53
4      5         France          FRA    16      26      22     64
..   ...            ...          ...   ...     ...     ...    ...
86    84           Peru          PER     0       0       1      1
87    84          Qatar          QAT     0       0       1      1
88    84      Singapore          SIN     0       0       1      1
89    84       Slovakia          SVK     0       0       1      1
90    84         Zambia          ZAM     0       0       1      1

[91 rows x 7 columns]

Dengan Python, kita dapat mengakses properti suatu objek dengan mengaksesnya sebagai atribut. Objek buku, misalnya, mungkin memiliki properti title, yang dapat kita akses dengan memanggil book.title. Kolom di pandas DataFrame bekerja dengan cara yang hampir sama.

Oleh karena itu untuk mengakses ulasan milik negara kita dapat menggunakan:

In [4]:
# contoh 1 menampilkan kolom negara dari dataframe
data_negara = Data.Country
data_negara

0     United States
1             China
2             Japan
3         Australia
4            France
          ...
86             Peru
87            Qatar
88        Singapore
89         Slovakia
90           Zambia
Name: Country, Length: 91, dtype: object

In [12]:
# contoh 2 mnenampilkan kolom suatu negara tertentu
Data['Country'][50]

'Greece'

Mengindeks data menggunakan pandas

Operator pengindeksan dan pemilihan atribut bagus karena berfungsi sama seperti di ekosistem Python lainnya. Sebagai seorang pemula, hal ini membuatnya mudah untuk diambil dan digunakan. Namun, panda memiliki operator pengaksesnya sendiri, loc dan iloc. Untuk operasi lebih lanjut, inilah yang seharusnya Anda gunakan.

1. indeks based selection
Pengindeksan Pandas bekerja dalam salah satu dari dua paradigma. Yang pertama adalah seleksi berbasis indeks: memilih data berdasarkan posisi numeriknya dalam data. iloc mengikuti paradigma ini.

In [13]:
# contoh 3 Untuk memilih baris pertama data dalam DataFrame, kita dapat menggunakan yang berikut ini:
Data.iloc[0]

Rank                        1
Country         United States
Country Code               US
Gold                       40
Silver                     44
Bronze                     42
Total                     126
Name: 0, dtype: object

Baik loc maupun iloc adalah baris pertama, kolom kedua. Ini kebalikan dari apa yang kita lakukan dengan Python asli, yaitu kolom pertama, baris kedua.

Artinya, mengambil baris sedikit lebih mudah, dan mengambil kolom sedikit lebih sulit. Untuk mendapatkan kolom dengan iloc, kita bisa melakukan hal berikut:

In [24]:
# contoh 4
Data.iloc[:, :4]

    Rank        Country Country Code  Gold
0      1  United States           US    40
1      2          China          CHN    40
2      3          Japan          JPN    20
3      4      Australia          AUS    18
4      5         France          FRA    16
..   ...            ...          ...   ...
86    84           Peru          PER     0
87    84          Qatar          QAT     0
88    84      Singapore          SIN     0
89    84       Slovakia          SVK     0
90    84         Zambia          ZAM     0

[91 rows x 4 columns]

In [25]:
# contoh 5
Data.iloc[:3, :4]

   Rank        Country Country Code  Gold
0     1  United States           US    40
1     2          China          CHN    40
2     3          Japan          JPN    20

In [30]:
# contoh 6
Data.iloc[:9, :]

   Rank        Country Country Code  Gold  Silver  Bronze  Total
0     1  United States           US    40      44      42    126
1     2          China          CHN    40      27      24     91
2     3          Japan          JPN    20      12      13     45
3     4      Australia          AUS    18      19      16     53
4     5         France          FRA    16      26      22     64
5     6    Netherlands          NED    15       7      12     34
6     7  Great Britain          GBG    14      22      29     65
7     8    South Korea          KOR    13       9      10     32
8     9          Italy          ITA    12      13      15     40

In [31]:
# contoh 7
Data.iloc[-9:]

    Rank               Country Country Code  Gold  Silver  Bronze  Total
82    80           Puerto Rico          PUR     0       0       2      2
83    84            Cape Verde          CPV     0       0       1      1
84    84           Ivory Coast          CIV     0       0       1      1
85    84  Refugee Olympic Team          EOR     0       0       1      1
86    84                  Peru          PER     0       0       1      1
87    84                 Qatar          QAT     0       0       1      1
88    84             Singapore          SIN     0       0       1      1
89    84              Slovakia          SVK     0       0       1      1
90    84                Zambia          ZAM     0       0       1      1

Label based selection / Seleksi berdasarkan label

Paradigma kedua untuk pemilihan atribut adalah yang diikuti oleh operator loc dalam pemilihan berbasis label. Dalam paradigma ini, yang penting adalah nilai indeks data, bukan posisinya.

In [32]:
# Misalnya, untuk mendapatkan entri pertama dalam ulasan, sekarang kami akan melakukan hal berikut:
# contoh 8
Data.loc[8,'Country']

'Italy'

iloc secara konseptual lebih sederhana daripada loc karena mengabaikan indeks kumpulan data. Saat kami menggunakan iloc, kami memperlakukan kumpulan data seperti matriks besar (daftar daftar), yang harus kami indeks berdasarkan posisi. loc, sebaliknya, menggunakan informasi dalam indeks untuk melakukan tugasnya. Karena kumpulan data Anda biasanya memiliki indeks yang bermakna, biasanya lebih mudah melakukan sesuatu menggunakan loc. Misalnya, inilah salah satu operasi yang lebih mudah menggunakan loc:

In [33]:
# contoh 9
Data.loc[9:, ['Rank', 'Country', 'Total']]

    Rank      Country  Total
9     10      Germany     33
10    11  New Zealand     20
11    12       Canada     27
12    13   Uzbekistan     13
13    14      Hungary     19
..   ...          ...    ...
86    84         Peru      1
87    84        Qatar      1
88    84    Singapore      1
89    84     Slovakia      1
90    84       Zambia      1

[82 rows x 3 columns]